In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
#importing
test = pd.read_csv('test.csv')
train = pd.read_csv('train.csv')
sample = pd.read_csv('test.csv')

In [3]:
test.head()

       ID  Gender Ever_Married  ...  Spending_Score Family_Size  Var_1
0  458989  Female          Yes  ...             Low         1.0  Cat_6
1  458994    Male          Yes  ...         Average         4.0  Cat_6
2  458996  Female          Yes  ...             Low         1.0  Cat_6
3  459000    Male          Yes  ...            High         2.0  Cat_6
4  459001  Female           No  ...             Low         4.0  Cat_6

[5 rows x 10 columns]

In [4]:
train.head()

       ID  Gender Ever_Married  ...  Family_Size  Var_1 Segmentation
0  462809    Male           No  ...          4.0  Cat_4            D
1  462643  Female          Yes  ...          3.0  Cat_4            A
2  466315  Female          Yes  ...          1.0  Cat_6            B
3  461735    Male          Yes  ...          2.0  Cat_6            B
4  462669  Female          Yes  ...          6.0  Cat_6            A

[5 rows x 11 columns]

In [5]:
test.isnull().sum(), train.isnull().sum()

(ID                   0
 Gender               0
 Ever_Married        50
 Age                  0
 Graduated           24
 Profession          38
 Work_Experience    269
 Spending_Score       0
 Family_Size        113
 Var_1               32
 dtype: int64, ID                   0
 Gender               0
 Ever_Married       140
 Age                  0
 Graduated           78
 Profession         124
 Work_Experience    829
 Spending_Score       0
 Family_Size        335
 Var_1               76
 Segmentation         0
 dtype: int64)

In [6]:
test.describe()

                  ID          Age  Work_Experience  Family_Size
count    2627.000000  2627.000000      2358.000000  2514.000000
mean   463433.918919    43.649791         2.552587     2.825378
std      2618.245698    16.967015         3.341094     1.551906
min    458989.000000    18.000000         0.000000     1.000000
25%    461162.500000    30.000000         0.000000     2.000000
50%    463379.000000    41.000000         1.000000     2.000000
75%    465696.000000    53.000000         4.000000     4.000000
max    467968.000000    89.000000        14.000000     9.000000

In [7]:
train.describe()

                  ID          Age  Work_Experience  Family_Size
count    8068.000000  8068.000000      7239.000000  7733.000000
mean   463479.214551    43.466906         2.641663     2.850123
std      2595.381232    16.711696         3.406763     1.531413
min    458982.000000    18.000000         0.000000     1.000000
25%    461240.750000    30.000000         0.000000     2.000000
50%    463472.500000    40.000000         1.000000     3.000000
75%    465744.250000    53.000000         4.000000     4.000000
max    467974.000000    89.000000        14.000000     9.000000

In [8]:
train_copy = train.copy()
test_copy = test.copy()
train_copy = train_copy.drop(['Segmentation'], axis = 1)

In [9]:
# Concatinating data for prperpcessing purposes
train_copy['train'] = 1
test_copy['train'] = 0

In [10]:
#concatinating for the better joing of values
data = pd.concat([train_copy,test_copy], axis = 0)
data.shape

(10695, 11)

# presprocessing

In [11]:

train_copy.isnull().sum()

ID                   0
Gender               0
Ever_Married       140
Age                  0
Graduated           78
Profession         124
Work_Experience    829
Spending_Score       0
Family_Size        335
Var_1               76
train                0
dtype: int64

In [12]:
#  fill the missing values using mean or mode


data['Ever_Married'] = data['Ever_Married'].fillna(train_copy['Ever_Married'].mode()[0])

data['Graduated'] = data['Graduated'].fillna(train_copy['Graduated'].mode()[0])

data['Profession'] = data['Profession'].fillna(train_copy['Profession'].mode()[0])

data['Work_Experience'] = data['Work_Experience'].fillna(train_copy['Work_Experience'].mode()[0])

data['Family_Size'] = data['Family_Size'].fillna(train_copy['Family_Size'].mode()[0])

data['Var_1'] = data['Var_1'].fillna(train_copy['Var_1'].mode()[0])

data.isnull().sum()

ID                 0
Gender             0
Ever_Married       0
Age                0
Graduated          0
Profession         0
Work_Experience    0
Spending_Score     0
Family_Size        0
Var_1              0
train              0
dtype: int64

In [13]:
data.head()

       ID  Gender Ever_Married  Age  ... Spending_Score Family_Size  Var_1 train
0  462809    Male           No   22  ...            Low         4.0  Cat_4     1
1  462643  Female          Yes   38  ...        Average         3.0  Cat_4     1
2  466315  Female          Yes   67  ...            Low         1.0  Cat_6     1
3  461735    Male          Yes   67  ...           High         2.0  Cat_6     1
4  462669  Female          Yes   40  ...           High         6.0  Cat_6     1

[5 rows x 11 columns]

In [14]:
#label encoding Gender Ever_Married Graduated Spending_Score
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
columns = ['Gender','Ever_Married','Graduated']
for col in columns:
    data[col] = le.fit_transform(data[col])
    
data.head()

       ID  Gender  Ever_Married  Age  ...  Spending_Score Family_Size  Var_1 train
0  462809       1             0   22  ...             Low         4.0  Cat_4     1
1  462643       0             1   38  ...         Average         3.0  Cat_4     1
2  466315       0             1   67  ...             Low         1.0  Cat_6     1
3  461735       1             1   67  ...            High         2.0  Cat_6     1
4  462669       0             1   40  ...            High         6.0  Cat_6     1

[5 rows x 11 columns]

In [15]:
data['Spending_Score'] = data['Spending_Score'].map({'Low': 0, 'Average':1, 'High':2}) 
data

          ID  Gender  Ever_Married  ...  Family_Size  Var_1 train
0     462809       1             0  ...          4.0  Cat_4     1
1     462643       0             1  ...          3.0  Cat_4     1
2     466315       0             1  ...          1.0  Cat_6     1
3     461735       1             1  ...          2.0  Cat_6     1
4     462669       0             1  ...          6.0  Cat_6     1
...      ...     ...           ...  ...          ...    ...   ...
2622  467954       1             0  ...          4.0  Cat_6     0
2623  467958       0             0  ...          1.0  Cat_6     0
2624  467960       0             0  ...          2.0  Cat_6     0
2625  467961       1             1  ...          5.0  Cat_4     0
2626  467968       0             0  ...          3.0  Cat_7     0

[10695 rows x 11 columns]

In [16]:
 train_copy.Profession.value_counts()

Artist           2516
Healthcare       1332
Entertainment     949
Engineer          699
Doctor            688
Lawyer            623
Executive         599
Marketing         292
Homemaker         246
Name: Profession, dtype: int64

In [17]:
#The variable 'Profession' has 9 categories. But among these 9 categories, only initial 3-4

data['Profession'] = data['Profession'].replace(['Lawyer','Executive','Marketing','Homemaker'],'Other')

data['Var_1'] = data['Var_1'].replace(['Cat_5','Cat_1','Cat_7','Cat_2'],'Other')
data['Var_1'].value_counts()
# data.drop(['Profession_counts'], axis = 1,inplace = True)

Cat_6    7018
Cat_4    1475
Other    1113
Cat_3    1089
Name: Var_1, dtype: int64

In [18]:
data = pd.get_dummies(data, columns = ['Profession','Var_1'])

In [19]:
data

          ID  Gender  Ever_Married  ...  Var_1_Cat_4  Var_1_Cat_6  Var_1_Other
0     462809       1             0  ...            1            0            0
1     462643       0             1  ...            1            0            0
2     466315       0             1  ...            0            1            0
3     461735       1             1  ...            0            1            0
4     462669       0             1  ...            0            1            0
...      ...     ...           ...  ...          ...          ...          ...
2622  467954       1             0  ...            0            1            0
2623  467958       0             0  ...            0            1            0
2624  467960       0             0  ...            0            1            0
2625  467961       1             1  ...            1            0            0
2626  467968       0             0  ...            0            0            1

[10695 rows x 19 columns]

In [20]:
training_preprocessed  = data[data['train']==1]
training_preprocessed

          ID  Gender  Ever_Married  ...  Var_1_Cat_4  Var_1_Cat_6  Var_1_Other
0     462809       1             0  ...            1            0            0
1     462643       0             1  ...            1            0            0
2     466315       0             1  ...            0            1            0
3     461735       1             1  ...            0            1            0
4     462669       0             1  ...            0            1            0
...      ...     ...           ...  ...          ...          ...          ...
8063  464018       1             0  ...            0            0            1
8064  464685       1             0  ...            1            0            0
8065  465406       0             0  ...            0            1            0
8066  467299       0             0  ...            0            1            0
8067  461879       1             1  ...            1            0            0

[8068 rows x 19 columns]

In [21]:
training_preprocessed['Segmentation'] = train.Segmentation
#training_preprocessed['Segmentation'] = training_preprocessed['Segmentation'].map({'A':0,'B':1,'C':2,'D':3})
training_preprocessed = training_preprocessed.drop(['train'], axis = 1)

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [22]:
# Splitting into dependent and independent variables
X_train = training_preprocessed.drop(['Segmentation'],axis = 1)
Y_train = training_preprocessed['Segmentation']

In [23]:
training_preprocessed

          ID  Gender  Ever_Married  ...  Var_1_Cat_6  Var_1_Other  Segmentation
0     462809       1             0  ...            0            0             D
1     462643       0             1  ...            0            0             A
2     466315       0             1  ...            1            0             B
3     461735       1             1  ...            1            0             B
4     462669       0             1  ...            1            0             A
...      ...     ...           ...  ...          ...          ...           ...
8063  464018       1             0  ...            0            1             D
8064  464685       1             0  ...            0            0             D
8065  465406       0             0  ...            1            0             D
8066  467299       0             0  ...            1            0             B
8067  461879       1             1  ...            0            0             B

[8068 rows x 19 columns]

In [24]:
X_train

          ID  Gender  Ever_Married  ...  Var_1_Cat_4  Var_1_Cat_6  Var_1_Other
0     462809       1             0  ...            1            0            0
1     462643       0             1  ...            1            0            0
2     466315       0             1  ...            0            1            0
3     461735       1             1  ...            0            1            0
4     462669       0             1  ...            0            1            0
...      ...     ...           ...  ...          ...          ...          ...
8063  464018       1             0  ...            0            0            1
8064  464685       1             0  ...            1            0            0
8065  465406       0             0  ...            0            1            0
8066  467299       0             0  ...            0            1            0
8067  461879       1             1  ...            1            0            0

[8068 rows x 18 columns]

In [25]:
X_test = data[data['train'] == 0]
X_test = X_test.drop(['train'], axis = 1)

# training stage

In [26]:
from sklearn.metrics import accuracy_score
def get_score(model,x_train, x_test, y_train, y_test):
    model.fit(x_train,y_train)
    y_predict = model.predict(x_test)
    accuracy = accuracy_score(y_test, y_predict)
    return accuracy

In [27]:
from sklearn.model_selection import KFold
from xgboost import XGBClassifier


from sklearn.ensemble import RandomForestClassifier, BaggingClassifier



from sklearn.model_selection import RepeatedStratifiedKFold, GridSearchCV

xgb = XGBClassifier()

In [28]:

kf = KFold(n_splits = 6)
score_xgb= []
# score_lgbm = []


for train_index, test_index in kf.split(X_train):
    x_train, x_val, y_train, y_val = X_train.iloc[train_index],X_train.iloc[test_index],Y_train.iloc[train_index],Y_train.iloc[test_index]
    score_xgb.append(get_score(xgb,x_train, x_val, y_train, y_val))

#     #score_xgb.append(get_score(xgb,x_train, x_val, y_train, y_val)) #Using XGBooster

print('Accurcay for Bagging is {} ({})'.format(np.mean(score_xgb), np.std(score_xgb)))
# # print('Accurcay for xgb is {} ({})'.format(np.mean(score_xgb), np.std(score_xgb)))
# # print('Accurcay for catb is {} ({})'.format(np.mean(score_catb), np.std(score_catb)))

Accurcay for Bagging is 0.5363193891249188 (0.01552196081084776)

In [29]:
# Training using the whole dataset
xgb.fit(X_train,Y_train)
predict = xgb.predict(X_test)

In [30]:
predict

array(['A', 'C', 'B', ..., 'A', 'B', 'D'], dtype=object)

In [31]:
# Writing the test results to a separate dataframe
submission = pd.DataFrame()
submission['ID'] = test_copy['ID']
submission['Segmentation'] = predict
submission.to_csv('submissionnew.csv', index = False)